// 活动类型配置
const activityTypes = [
  {
    name: '运动竞技',
    subTypes: [
      ['篮球', '足球', '羽毛球', '乒乓球', '网球', '排球', '匹克球', '壁球'],
      ['登山', '徒步', '骑行', '攀岩', '探险', '定向越野'],
      ['健身', '瑜伽', '普拉提', '搏击', '操课', '舞蹈'],
      ['飞盘', '橄榄球', '跑步', '马拉松', '太极'],
      ['台球', '保龄球', '射箭', '高尔夫', '卡丁车'],
      ['皮划艇', '潜水', '冲浪', '帆船', '钓鱼', '游泳'],
      ['滑雪', '冰球', '滑冰', '冰壶']
    ].flat()
  },
  {
    name: '文化艺术',
    subTypes: ['非遗', '艺术展', '音乐会', '演唱会', '读书/文学', '电影', '戏剧', '摄影', '手工DIY']
  },
  {
    name: '职业创业',
    subTypes: ['行业交流', '企业参访', '行业峰会', '职业培训']
  },
  {
    name: '休闲娱乐',
    subTypes: ['电子游戏', '桌游', '旅行', '密室逃脱', '剧本杀', '线下观赛']
  },
  {
    name: '亲子',
    subTypes: ['亲子活动', '教育沙龙', '家庭旅行']
  },
  {
    name: '社交',
    subTypes: ['聚餐']
  },
  {
    name: '学习',
    subTypes: ['大咖讲座', '学术交流', '语言角', '考试互助']
  }
]

module.exports = activityTypes